tests/load/simple.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 5
      arrivalRate: 20
      name: "Warming up"
    - duration: 10
      arrivalRate: 20
      rampTo: 100
      name: "Ramping up"
    - duration: 40
      arrivalRate: 100
      name: "Sustained load"
 
scenarios:
  - name: "Graphql "
    flow:
      - get:
          url: "http://localhost:3000/test"